src/cf/Catalogs/уатПластиковыеКарты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатПластиковыеКарты</Name>
			<Comment>(уат)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КемВыдана</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.уатАЗС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомуВыдана</Name>
					<Comment>Кому выдана</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основная</Name>
					<Comment>Основная топливная карта</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСтатусыТопливныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПинКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDкарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЛимит</Name>
					<Comment>Помечено на удаление в релизе 1.1.30.1</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатСтатусыКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/уатИсторияПеремещенияТопливныхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатИсторияПеремещенияТопливныхКарт</Name>
			<Comment>Используется для хранения истории изменения владельца карты</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КомуВыдана</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Карта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПластиковыеКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/уатПластиковыеКарты/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Основная Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	уатПластиковыеКарты.Основная,
		|	уатПластиковыеКарты.КомуВыдана,
		|	уатПластиковыеКарты.КемВыдана,
		|	уатПластиковыеКарты.Ссылка
		|ИЗ
		|	Справочник.уатПластиковыеКарты КАК уатПластиковыеКарты
		|ГДЕ
		|	уатПластиковыеКарты.КомуВыдана = &КомуВыдана
		|	И уатПластиковыеКарты.Основная = ИСТИНА
		|	И уатПластиковыеКарты.Ссылка <> &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("КомуВыдана", КомуВыдана);
		
		ТЗ = Запрос.Выполнить().Выгрузить();
		Если ТЗ.Количество() > 0 Тогда
				СпрОбъект = ТЗ[0].Ссылка.ПолучитьОбъект();
				СпрОбъект.Основная = Ложь;
				СпрОбъект.Записать();
				ТекстНСТР = НСтр("en='Installed new main fuel card for ""%1"" (old main card: ""%2"")';ru='Установлена новая основная топливная карта для ""%1"" (старая основная карта: ""%2"")'");
				ТекстНСТР = СтрШаблон(ТекстНСТР, КомуВыдана, ТЗ[0].Ссылка);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЗначениеЗаполнено(ДатаВыдачи)
		ИЛИ ЗначениеЗаполнено(КомуВыдана) Тогда 
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Карта",      Ссылка);
		Запрос.УстановитьПараметр("Период",     ДатаВыдачи); 
		Запрос.УстановитьПараметр("КомуВыдана", КомуВыдана);
		Запрос.Текст = "ВЫБРАТЬ
		               |	уатИсторияПеремещенияТопливныхКарт.Период КАК Период,
		               |	уатИсторияПеремещенияТопливныхКарт.Карта КАК Карта,
		               |	уатИсторияПеремещенияТопливныхКарт.КомуВыдана КАК КомуВыдана
		               |ИЗ
		               |	РегистрСведений.уатИсторияПеремещенияТопливныхКарт КАК уатИсторияПеремещенияТопливныхКарт
		               |ГДЕ
		               |	уатИсторияПеремещенияТопливныхКарт.Карта = &Карта
		               |	И уатИсторияПеремещенияТопливныхКарт.КомуВыдана = &КомуВыдана
		               |	И уатИсторияПеремещенияТопливныхКарт.Период = &Период";
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда 
			НаборЗаписей = РегистрыСведений.уатИсторияПеремещенияТопливныхКарт.СоздатьНаборЗаписей();
			НаборЗаписей.Заполнить(Неопределено);  
			НаборЗаписей.Отбор.Карта.Установить(Ссылка); 
			НаборЗаписей.Отбор.Период.Установить(ДатаВыдачи);
			НаборЗаписей.Прочитать();
			Если НаборЗаписей.Количество() <> 0 Тогда
				НаборЗаписей.Очистить();
			КОнецЕсли; 
			
			Запись = НаборЗаписей.Добавить();
			Запись.Период		 = ?(ЗначениеЗаполнено(ДатаВыдачи), ДатаВыдачи, ТекущаяДатаСеанса());
			Запись.Карта		 = Ссылка;
			Запись.КомуВыдана	 = КомуВыдана;
			Попытка
				НаборЗаписей.Записать();
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
